
/* Мінімум

Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.
Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.
Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку. */

let result = (0.1 + 0.2).toFixed(2);
console.log(result);


let a = "1";
let b = 2;
let x = a + b;
console.log(x);

let flash = prompt('Введіть обсяг флешки в Гб');
let files = console.log(flash * 820);

// Норма

// Користувач вводить суму грошей в гаманці і ціну однієї шоколадки. Програма виводить скільки шоколадок може купити користувач і скільки здачі у нього залишиться.
// Запитай у користувача тризначне число і виведи його задом наперед. Для вирішення завдання тобі знадобиться оператор % (залишок від ділення). 

let sum = prompt('Введіть cумму, грн')
let price = prompt('Введіть ціну шоколадки, грн')
prompt(sum / price)
prompt(sum % price)

/* Максимум

Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5% річних. Вивести суму нарахованих відсотків.

Що повернуть вирази:
 2 && 0 && 3
 2 || 0 || 3
 2 && 0 || 3 */


let a = prompt('Введіть суму в гривні')
let b = prompt('Введіть бажаний термін депозиту')
const annualRate = 5
console.log(a * b * annualRate)

2 && 0 && 3     // 0
2 || 0 || 3     // 2
2 && 0 || 3     // 3